#include <vector>
#include <iostream>

int main()
{
	//*********************************************************************************
	//크기가 0인 벡터 선언
	//std::vector<int> vec;

	//지정한 초깃값으로 이루어진 크기가 5인 벡터 선언
	//std::vector<int> vec = { 1,2,3,4,5 };

	//크기가 10인 벡터 선언
	//std::vector<int> vec(10);

	//크기가 10이고, 모든 원소가 5로 초기화된 벡터 선언
	//std::vector<int> vec(10, 5);

	//벡터의 맨 앞에 새로운 원소 0 추가
	//vec.insert(vec.begin(), 0);
	//*********************************************************************************



	//*********************************************************************************
	////비어 있는 벡터 생성: {}
	//std::vector<int> vec; 
	//
	////맨 뒤에 1 추가: {1}
	//vec.push_back(1);

	////맨 앞에 0 추가: {0,1}
	//vec.insert(vec.begin(), 0);

	////1 앞에 4 추가: {0,4,1}
	//vec.insert(find(vec.begin(), vec.end(), 1), 4);
	//*********************************************************************************



	//*********************************************************************************
	//std::vector<int> vec = { 0,1,2,3,4,5,6,7,8,9 };

	////맨 마지막 원소를 하나 제거: {0,1,2,3,4,5,6,7,8}
	//vec.pop_back();

	////맨 처음 원소를 제거: {1,2,3,4,5,6,7,8}
	//vec.erase(vec.begin());

	////1번째 원소부터 4번째 앞 원소까지 제거: {1,5,6,7,8}
	//vec.erase(vec.begin()+1, vec.begin() + 4);
	//*********************************************************************************




	return 0;
}