#include <iostream>
#include <forward_list>

int main()
{
	//*********************************************************************************
	//std::forward_list<int> fwd_list = { 1,2,3 };

	//fwd_list.push_front(0); //맨 앞에 0 추가 : {0,1,2,3}

	//auto it = fwd_list.begin();

	//fwd_list.insert_after(it, 5); // 맨 처음 원소 뒤에 5 추가 : {0,5,1,2,3}

	//fwd_list.insert_after(it, 6); // {0,6,5,1,2,3}
	//*********************************************************************************



	//*********************************************************************************
	//리스트에서 원소를 삭제하는 코드
	std::forward_list<int> fwd_list = { 1,2,3,4,5 };
	
	fwd_list.pop_front(); //맨 앞 원소를 삭제: {2,3,4,5}

	auto it = fwd_list.begin();

	fwd_list.erase_after(it); //맨 앞의 다음 원소를 삭제: {2,4,5}

	fwd_list.erase_after(it, fwd_list.end()); //맨 앞의 다음 원소부터 마지막 원소까지 삭제: {2}
	//*********************************************************************************



	return 0;
}